export const CARD_TITLES = {
  CARD_1: "取引の情報を入力しましょう",
  CARD_2: "足りていない情報を追加しましょう",
  CARD_3: "計算結果を確認しましょう",
};

export const CARD_DESCRIPTIONS = {
  CARD_1: "仮想通貨の損益計算には過去すべての取引履歴が必要になります。",
  CARD_2: "情報が不足していると計算が完了しません。必ず追加してください。",
  CARD_3:
    "計算結果の最終的なチェックを行って確定申告に必要な情報を確認しましょう。最後にデータをダウンロードできます。",
};

export const CARD_DETAILS_TITLES = {
  CARD_1: "取引所 / ブロックチェーンを選択しましょう",
  CARD_2: "取引履歴を反映させましょう",
  CARD_3: "DeFi取引における「要識別」を解消しましょう",
  CARD_4: "未分類取引を解消しましょう",
  CARD_5: "データをダウンロードする",
  CARD_6: "ドキュメントを確認してください",
};

export const CARD_DETAILS_DESCRIPTIONS = {
  CARD_1:
    "取引をしたことのある取引所 / ブロックチェーンをすべて選択してください。対応していない取引所や取引所外での取引経験がある場合は「カスタム」を選択してください。",
  CARD_2:
    "ファイルやAPI連携で履歴を反映させることができます。DeFiの取引はウォレットアドレスを入力することで取引内容まで自動識別することができます。",
  CARD_3:
    "必要な情報が足りていないため、自動で識別できなかった取引や、DeFi取引以外の入出金取引については、「要識別」として分類されます。このページで取引種類を選択し、計算ができる状態にしてください。",
  CARD_4:
    "アップロードされた全ての取引を集計する過程で、クリプタクトが処理出来なかった取引は、「未分類取引」として分類されます。未分類取引は損益計算から除外されるため、ウィザード機能を活用し必ず解消してください。",
  CARD_5:
    "このアクションは、重要な情報や詳細な情報が提供されているドキュメントを参照する際に使用されます。ドキュメントには、製品の使用方法、指示、ガイドライン",
  CARD_6:
    "このアクションは、情報を入手したり、詳細な情報にアクセスするために使用されます。主に、製品の使用方法、指示、ガイドライン、規則、または他の重要な情報を含むドキュメントにアクセスするのに役立ちます。",
};

export const ACTION_LABELS = {
  SELECT: "選択する",
  ADD: "追加する",
  IDENTIFY: "識別する",
  RESOLVE: "解消する",
};
